import { List, Progress, Typography } from "antd";


const mock = {
  "data": [
    {
      "_id": "6793ffce52c6ee0506dd9530",
      "id": 1322,
      "name": "СТС Love",
      "icon": "http://epg.one/img2/1322.png",
      "__v": 0,
      "currentProgram": [
        {
          "_id": "6795694e885bc096e8921cb2",
          "start": "2025-02-04T20:45:00.000Z",
          "stop": "2025-02-04T22:06:33.000Z",
          "channel": 1322,
          "title": "Сердца за любовь (137-я серия). Сезон 3. Серия 57.",
          "description": "2016 г.\n\nГод: 2016. Год: 2016. Шоу знакомств и аукцион в одном лице, где каждая девушка будет бороться за внимание парней на необычном аукционе. Главная цель очаровательных участниц аукциона - найти свою вторую половинку (16+)",
          "category": "",
          "lang": "ru",
          "__v": 0
        },
        {
          "_id": "6795694e885bc096e8921cb4",
          "start": "2025-02-04T22:06:33.000Z",
          "stop": "2025-02-04T22:31:52.000Z",
          "channel": 1322,
          "title": "Сердца за любовь",
          "description": "Развлечения, Романтика, Россия\nРежисер: Никита Снегов\n\nШоу знакомств и аукцион в одном лице, где каждая девушка будет бороться за внимание парней на необычном аукционе. Главная цель очаровательных участниц аукциона - найти свою вторую половинку",
          "category": "ТВ-шоу",
          "lang": "ru",
          "__v": 0
        },
        {
          "_id": "6795694e885bc096e8921cb6",
          "start": "2025-02-04T22:31:52.000Z",
          "stop": "2025-02-04T22:57:11.000Z",
          "channel": 1322,
          "title": "Сердца за любовь",
          "description": "Развлечения, Романтика, Россия\nРежисер: Никита Снегов\n\nШоу знакомств и аукцион в одном лице, где каждая девушка будет бороться за внимание парней на необычном аукционе. Главная цель очаровательных участниц аукциона - найти свою вторую половинку",
          "category": "ТВ-шоу",
          "lang": "ru",
          "__v": 0
        },
        {
          "_id": "6795694e885bc096e8921cb8",
          "start": "2025-02-04T22:57:11.000Z",
          "stop": "2025-02-04T23:22:30.000Z",
          "channel": 1322,
          "title": "Сердца за любовь",
          "description": "Развлечения, Романтика, Россия\nРежисер: Никита Снегов\n\nШоу знакомств и аукцион в одном лице, где каждая девушка будет бороться за внимание парней на необычном аукционе. Главная цель очаровательных участниц аукциона - найти свою вторую половинку",
          "category": "ТВ-шоу",
          "lang": "ru",
          "__v": 0
        }
      ]
    },
    {
      "_id": "6793ffcf52c6ee0506dd978a",
      "id": 7987,
      "name": "СТС LOVE (+2)",
      "icon": "http://epg.one/img2/7987.png",
      "__v": 0,
      "currentProgram": [
        {
          "_id": "67956a75885bc096e894d260",
          "start": "2025-02-04T21:40:00.000Z",
          "stop": "2025-02-04T22:55:00.000Z",
          "channel": 7987,
          "title": "ntest",
          "description": "Страна: Россия. Год: 2016. Жанр: тв-шоу, досуг.\n...Ищешь свою любовь? Постоянно зависаешь на сайтах знакомств в надежде встретить того единственного и неповторимого, с которым вы проживете в любви и согласии всю жизнь? Давай признаем честно: это способ не такой уж надежный. Ведь за фотографией, подозрительно напоминающей Райна Гослинга, и фразой \"люблю сочинять стихи и гулять под луной\" легко может скрываться замкнутый геймер, на первом свидании с которым вы только и будете делать, что обсуждать его борьбу с огнедышащими драконами. Согласись, вряд ли это то времяпровождение, о котором ты мечтала? Чтобы помочь тебе избежать этого подвоха и не попасть на \"кота в мешке\", новое шоу - аукцион, главный \"лот\" которого - парень мечты! А достанется он той девушке, которая предложит за него максимальное количество баллов. Борьба будет жаркой!",
          "category": "Досуг",
          "lang": "ru",
          "__v": 0
        }
      ]
    },
    {
      "_id": "6793ffcf52c6ee0506dd978c",
      "id": 7988,
      "name": "СТС LOVE (+4)",
      "icon": "http://epg.one/img2/7988.png",
      "__v": 0,
      "currentProgram": [
        {
          "_id": "67956a75885bc096e894d2d6",
          "start": "2025-02-04T16:00:00.000Z",
          "stop": "2025-02-04T22:55:00.000Z",
          "channel": 7988,
          "title": "Сердца за любовь. 133-я - 135-я, 26-я - 38-я серии (16+).",
          "description": "Страна: Россия. Год: 2016. Жанр: тв-шоу, досуг.\n...Ищешь свою любовь? Постоянно зависаешь на сайтах знакомств в надежде встретить того единственного и неповторимого, с которым вы проживете в любви и согласии всю жизнь? Давай признаем честно: это способ не такой уж надежный. Ведь за фотографией, подозрительно напоминающей Райна Гослинга, и фразой \"люблю сочинять стихи и гулять под луной\" легко может скрываться замкнутый геймер, на первом свидании с которым вы только и будете делать, что обсуждать его борьбу с огнедышащими драконами. Согласись, вряд ли это то времяпровождение, о котором ты мечтала? Чтобы помочь тебе избежать этого подвоха и не попасть на \"кота в мешке\", новое шоу - аукцион, главный \"лот\" которого - парень мечты! А достанется он той девушке, которая предложит за него максимальное количество баллов. Борьба будет жаркой!",
          "category": "Досуг",
          "lang": "ru",
          "__v": 0
        },
        {
          "_id": "67956a75885bc096e894d2d8",
          "start": "2025-02-04T22:55:00.000Z",
          "stop": "2025-02-04T23:00:00.000Z",
          "channel": 7988,
          "title": "Три кота. 142-я серия - \"В поисках кита\" (0+).",
          "description": "Режисер: Дмитрий Высоцкий\nВ ролях: Максим Сергеев, Илья Хрусталёв, Михаил Новодворцев, Александра Глушинская, Михаил Хрусталёв, Светлана Кузнецова, Владимир Маслаков, Анна Казанцева, Тимур Хамитов, София Гадасина\n\nСтрана: Россия. Год: 2015-2024. Жанр: приключения, детям.\n...В маленьком уютном домике живёт кошачья семья - мама, папа и три котёнка. Мама-кошка работает дизайнером детской одежды и любит подшучивать над окружающими. Папа-кот - работник кондитерской фабрики, немного рассеянный, но очень добрый. Старший котёнок Компот умный и рассудительный, средний - Коржик - весельчак, а младшая Карамелька самая сообразительная. Коржик, Карамелька и Компот очень любознательные котята и каждый день учатся чему-то новому. При помощи смекалки, фантазии и советов родителей они не только находят выход из любой ситуации, но и приобретают новые знания.Сценарий: Дмитрий Высоцкий, Дарина Шмидт\nПродюсеры: Юлия Миндубаева, Артём Васильев, Наталья Иванова-Достоевская\nКомпозитор: Алексей Яковель Режиссер: Дмитрий Высоцкий. В ролях: Максим Сергеев, Илья Хрусталёв, Михаил Новодворцев, Александра Глушинская, Михаил Хрусталёв, Светлана Кузнецова, Владимир Маслаков, Анна Казанцева, Тимур Хамитов, София Гадасина.",
          "category": "Детский",
          "lang": "ru",
          "__v": 0
        },
        {
          "_id": "67956a75885bc096e894d2da",
          "start": "2025-02-04T23:00:00.000Z",
          "stop": "2025-02-06T04:05:00.000Z",
          "channel": 7988,
          "title": "Три кота. 165-я - 208-я, 1-я - 6-я серии (0+).",
          "description": "Режисер: Дмитрий Высоцкий\nВ ролях: Максим Сергеев, Илья Хрусталёв, Михаил Новодворцев, Александра Глушинская, Михаил Хрусталёв, Светлана Кузнецова, Владимир Маслаков, Анна Казанцева, Тимур Хамитов, София Гадасина\n\nСтрана: Россия. Год: 2015-2024. Жанр: приключения, детям.\n...В маленьком уютном домике живёт кошачья семья - мама, папа и три котёнка. Мама-кошка работает дизайнером детской одежды и любит подшучивать над окружающими. Папа-кот - работник кондитерской фабрики, немного рассеянный, но очень добрый. Старший котёнок Компот умный и рассудительный, средний - Коржик - весельчак, а младшая Карамелька самая сообразительная. Коржик, Карамелька и Компот очень любознательные котята и каждый день учатся чему-то новому. При помощи смекалки, фантазии и советов родителей они не только находят выход из любой ситуации, но и приобретают новые знания.Сценарий: Дмитрий Высоцкий, Дарина Шмидт\nПродюсеры: Юлия Миндубаева, Артём Васильев, Наталья Иванова-Достоевская\nКомпозитор: Алексей Яковель Режиссер: Дмитрий Высоцкий. В ролях: Максим Сергеев, Илья Хрусталёв, Михаил Новодворцев, Александра Глушинская, Михаил Хрусталёв, Светлана Кузнецова, Владимир Маслаков, Анна Казанцева, Тимур Хамитов, София Гадасина.",
          "category": "Детский",
          "lang": "ru",
          "__v": 0
        }
      ]
    },
    {
      "_id": "6793ffd252c6ee0506dd9e22",
      "id": 1109,
      "name": "СТС LOVE (+7)",
      "icon": "http://epg.one/img2/1109.png",
      "__v": 0,
      "currentProgram": []
    }
  ],
  "total": 4,
  "page": 1,
  "limit": 5,
  "totalPages": 1
}
const {data} = mock
const ListChannel: React.FC = () => {
const dateFunc =(data:string)=>{
  const date = new Date(data)
  return String(date.getHours()).padStart(2,'0') + ":" + String(date.getMinutes()).padStart(2,'0') 
}

const countProgramProgress=(start:string,end:string)=>{
  
  const nowDate = new Date().getTime()
  console.log(new Date().toISOString())
  const startDate = new Date(start).getTime()
  const endDate= new Date(end).getTime()
  const total = ((nowDate-startDate)/(endDate-startDate)*100).toFixed(2)
  if (startDate < nowDate && nowDate < endDate){
    return  <Progress percent={total} status="active" showInfo={false} strokeColor={{ from: '#108ee9', to: '#87d068' }} />
  }
  else{
    return 'f'
  }
}
  return (
    <List
      pagination={{ position: "bottom", align: 'start' }}
      dataSource={data}
      renderItem={(item, index) => (
        <List.Item>
          <List.Item.Meta
            avatar={<img height={50} src={item.icon} />}
            title={<span>{item.name}</span>}
            description={<div>
             
              <List

                dataSource={item.currentProgram}
                renderItem={(elem) => (
                  <List.Item
                  extra={
                    <Typography.Text >{elem.category}</Typography.Text>}
                  >
                    <List.Item.Meta
                    avatar={ <span>{dateFunc(elem.start)}</span>}
                    title={elem.title}
                    description={<div>
                      {countProgramProgress(elem.start,elem.stop)}
                      {elem.description}
                    </div>}
                    />
                   
                  </List.Item>
                )}
              />
            </div>}
          />
        </List.Item>
      )}
    />
  );
};
export default ListChannel;